Post.destroy_all

puts "Destroyed everything you touch"

# posts = [

# {
# 	postauthor: "mason_276",
# 	content: "Трамп был избран президентом США по тайному сговору мирового правительства.Это произошло потому что Клинтон обещала рассекретить данные об НЛО."
# },

# {
# 	postauthor: "amy_any",
# 	content: "Движение Чайлдфри на самом деле - проект рептилоидов.По их плану человечество должно вымреть таким образом,чтоб Земля освободилась для их целей и нужд."
# },
# {
# 	postauthor: "truthIs_headden",
# 	content: "Существует тайный заговор производителей линолеумов и производителей чистящих средств. Производители линолеумов получают проценты с продажи чистящих средств, создавая линолеумы с неровной поверхностью, в которую легче забивается грязь."
# },
# {
# 	postauthor: "alien562",
# 	content: "Производители сковородок специально обучают их обжигать пальцы, чтобы люди не выходили из депрессии, что даже любимая сковородка их предала. Причем чем дороже сковородка, тем чаще она обжигает. Таким образом поддерживается один из главных законов жизни: за всё хорошее надо платить."
# },

# ]

# posts.each do |post|
# 	post = Post.create(post)
# 	puts "Some magic just create a post by #{ post.author} with id #{ post.id }!"
# end
