app/views/posts/_form.html.erb

SELECT "categories"."name", "categories"."id" FROM "categories"
---
            <%= form.label :category_id %>
            <%= form.select :category_id, Category.pluck(:name, :id) %>