app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "description", "display_in_navbar", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Призраки"], ["description", "Призраки"], ["display_in_navbar", 0], ["created_at", "2022-03-31 19:50:08.616928"], ["updated_at", "2022-03-31 19:50:08.616928"]]