app/controllers/commentts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "commentts" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Наверняка это инопланетяне"], ["post_id", 1], ["created_at", "2022-03-30 19:24:27.274370"], ["updated_at", "2022-03-30 19:24:27.274370"], ["user_id", 1]]
---
	def create
		@post = Post.find(params[:post_id])
		@commentt = @post.commentts.create(params[:commentt].permit(:body).merge(user_id: current_user.id))