app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 3], ["user_id", 1], ["created_at", "2022-03-31 07:58:45.727960"], ["updated_at", "2022-03-31 07:58:45.727960"]]
---
    def create
      if already_favorited?
        flash[:notice] = "You can't add to favorite more than once"
      else
        @post.favorites.create(user_id: current_user.id)

SELECT 1 AS one FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 3], ["LIMIT", 1]]
---
    def already_favorited?
      Favorite.where(user_id: current_user.id, post_id:
      params[:post_id]).exists?

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def find_post
      @post = Post.find(params[:post_id])