app/controllers/likes_controller.rb

INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 1], ["created_at", "2022-03-29 17:28:16.587889"], ["updated_at", "2022-03-29 17:28:16.587889"]]
---
    def create
      if already_liked?
        flash[:notice] = "You can't like more than once"
      else
        @post.likes.create(user_id: current_user.id)

SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]
---
   def already_liked?
    Like.where(user_id: current_user.id, post_id:
    params[:post_id]).exists?