app/controllers/posts_controller.rb

  def index
    @posts = Post.where(nil)
    filtering_params(params).each do |key, value|
      @posts = @posts.public_send("filter_by_#{key}", value) if value.present?
    end
    @users = User.all
    @categories = Category.all
---
SELECT "posts".* FROM "posts" WHERE (content like '%hou%')
SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users"
SELECT "categories".* FROM "categories"

  def show
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @post = Post.new(post_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id", "category_id") VALUES (?, ?, ?, ?, ?)  [["content", "В Бермудском треугольке не все ладно!"], ["created_at", "2022-04-02 07:00:44.781897"], ["updated_at", "2022-04-02 07:00:44.781897"], ["user_id", 1], ["category_id", 1]]