app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def show
        @user = User.find(params[:id])
        if @user
          @posts = @user.favorited_posts
          render actions: :show
          @favorites = @user.favorites.all